In [1]:
import pandas as pd
df = pd.read_csv("titanic.csv")
df.head()

   PassengerId                                               Name  Pclass     Sex  ...     Fare  Cabin  Embarked Survived
0            1                            Braund, Mr. Owen Harris       3    male  ...   7.2500    NaN         S        0
1            2  Cumings, Mrs. John Bradley (Florence Briggs Th...       1  female  ...  71.2833    C85         C        1
2            3                             Heikkinen, Miss. Laina       3  female  ...   7.9250    NaN         S        1
3            4       Futrelle, Mrs. Jacques Heath (Lily May Peel)       1  female  ...  53.1000   C123         S        1
4            5                           Allen, Mr. William Henry       3    male  ...   8.0500    NaN         S        0

[5 rows x 12 columns]

In [2]:
df = df.drop(["PassengerId", "Name", "SibSp", "Parch", "Ticket", "Cabin", "Embarked"], axis=1)
df

     Pclass     Sex   Age     Fare  Survived
0         3    male  22.0   7.2500         0
1         1  female  38.0  71.2833         1
2         3  female  26.0   7.9250         1
3         1  female  35.0  53.1000         1
4         3    male  35.0   8.0500         0
..      ...     ...   ...      ...       ...
886       2    male  27.0  13.0000         0
887       1  female  19.0  30.0000         1
888       3  female   NaN  23.4500         0
889       1    male  26.0  30.0000         1
890       3    male  32.0   7.7500         0

[891 rows x 5 columns]

In [3]:
target = df.Survived
inputs = df.drop("Survived", axis=1)

In [5]:
dummies = pd.get_dummies(pd.Series(list(inputs.Sex)), dtype=int)
dummies

     female  male
0         0     1
1         1     0
2         1     0
3         1     0
4         0     1
..      ...   ...
886       0     1
887       1     0
888       1     0
889       0     1
890       0     1

[891 rows x 2 columns]

In [6]:
inputs = pd.concat([inputs, dummies], axis=1)
inputs.head()

   Pclass     Sex   Age     Fare  female  male
0       3    male  22.0   7.2500       0     1
1       1  female  38.0  71.2833       1     0
2       3  female  26.0   7.9250       1     0
3       1  female  35.0  53.1000       1     0
4       3    male  35.0   8.0500       0     1

In [7]:
inputs = inputs.drop("Sex", axis=1)
inputs

     Pclass   Age     Fare  female  male
0         3  22.0   7.2500       0     1
1         1  38.0  71.2833       1     0
2         3  26.0   7.9250       1     0
3         1  35.0  53.1000       1     0
4         3  35.0   8.0500       0     1
..      ...   ...      ...     ...   ...
886       2  27.0  13.0000       0     1
887       1  19.0  30.0000       1     0
888       3   NaN  23.4500       1     0
889       1  26.0  30.0000       0     1
890       3  32.0   7.7500       0     1

[891 rows x 5 columns]

In [8]:
inputs.isna().sum()

Pclass      0
Age       177
Fare        0
female      0
male        0
dtype: int64

In [11]:
mean_age  = round(inputs.Age.mean())

In [12]:
inputs.Age = inputs.Age.fillna(mean_age)
inputs.isna().sum()

Pclass    0
Age       0
Fare      0
female    0
male      0
dtype: int64

In [19]:
from sklearn.model_selection import train_test_split
X_train,X_test, y_train, y_test = train_test_split(inputs, target, test_size=0.20)

In [20]:
len(X_train)

712

In [21]:
len(X_test)

179

In [22]:
from sklearn.naive_bayes import GaussianNB
model  = GaussianNB()

In [23]:
model.fit(X_train, y_train)

GaussianNB()

In [24]:
model.score(X_test, y_test)

0.7541899441340782

In [25]:
X_test[:10]

     Pclass   Age      Fare  female  male
444       3  30.0    8.1125       0     1
583       1  36.0   40.1250       0     1
694       1  60.0   26.5500       0     1
363       3  35.0    7.0500       0     1
689       1  15.0  211.3375       1     0
456       1  65.0   26.5500       0     1
53        2  29.0   26.0000       1     0
203       3  45.5    7.2250       0     1
97        1  23.0   63.3583       0     1
573       3  30.0    7.7500       1     0

In [26]:
y_test[:10]

444    1
583    0
694    0
363    0
689    1
456    0
53     1
203    0
97     1
573    1
Name: Survived, dtype: int64

In [27]:
model.predict(X_test[:10])

array([0, 0, 0, 0, 1, 0, 1, 0, 0, 1], dtype=int64)

In [28]:
model.predict_proba(X_test[:10])

array([[9.90891407e-01, 9.10859312e-03],
       [9.06988893e-01, 9.30111072e-02],
       [9.38017916e-01, 6.19820842e-02],
       [9.91461686e-01, 8.53831406e-03],
       [2.86870431e-12, 1.00000000e+00],
       [9.37796003e-01, 6.22039968e-02],
       [2.01136764e-02, 9.79886324e-01],
       [9.92369637e-01, 7.63036318e-03],
       [7.54619282e-01, 2.45380718e-01],
       [4.62246364e-02, 9.53775364e-01]])